## Staging: lambda-api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 4 to add, 0 to change, 4 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.errors-lambda-api will be created
  + resource "aws_cloudwatch_log_metric_filter" "errors-lambda-api" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/api-lambda"
      + name           = "errors-lambda-api"
      + pattern        = "/\"levelname\": \"ERROR\"/"

      + metric_transformation {
          + name      = "errors-lambda-api"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.web-500-errors-lambda-api will be destroyed
  - resource "aws_cloudwatch_log_metric_filter" "web-500-errors-lambda-api" {
      - id             = "web-500-errors-lambda-api" -> null
      - log_group_name = "/aws/lambda/api-lambda" -> null
      - name           = "web-500-errors-lambda-api" -> null
      - pattern        = "\"\\\" 500 \"" -> null

      - metric_transformation {
          - dimensions = {} -> null
          - name       = "500-errors-lambda-api" -> null
          - namespace  = "LogMetrics" -> null
          - unit       = "None" -> null
          - value      = "1" -> null
        }
    }

  # aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-lambda-api will be destroyed
  - resource "aws_cloudwatch_metric_alarm" "logs-1-500-error-1-minute-warning-lambda-api" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ] -> null
      - alarm_description         = "One 500 error in 1 minute for lambda api" -> null
      - alarm_name                = "logs-1-500-error-1-minute-warning-lambda-api" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:239043911459:alarm:logs-1-500-error-1-minute-warning-lambda-api" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "logs-1-500-error-1-minute-warning-lambda-api" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "500-errors-lambda-api" -> null
      - namespace                 = "LogMetrics" -> null
      - ok_actions                = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ] -> null
      - period                    = 60 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-1-error-1-minute-warning-lambda-api" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "One error in 1 minute for lambda api"
      + alarm_name                            = "logs-1-error-1-minute-warning-lambda-api"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "errors-lambda-api"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-lambda-api will be destroyed
  - resource "aws_cloudwatch_metric_alarm" "logs-10-500-error-5-minutes-critical-lambda-api" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ] -> null
      - alarm_description         = "Ten 500 errors in 5 minutes for lambda api" -> null
      - alarm_name                = "logs-10-500-error-5-minutes-critical-lambda-api" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:239043911459:alarm:logs-10-500-error-5-minutes-critical-lambda-api" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "logs-10-500-error-5-minutes-critical-lambda-api" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "500-errors-lambda-api" -> null
      - namespace                 = "LogMetrics" -> null
      - ok_actions                = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ] -> null
      - period                    = 300 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 10 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-10-error-5-minutes-critical-lambda-api" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Ten errors in 5 minutes for lambda api"
      + alarm_name                            = "logs-10-error-5-minutes-critical-lambda-api"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "errors-lambda-api"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_query_definition.api-lambda-50X-errors will be destroyed
  - resource "aws_cloudwatch_query_definition" "api-lambda-50X-errors" {
      - id                  = "2b6c079f-d355-4c8b-9a6c-28d062ebf3be" -> null
      - log_group_names     = [
          - "/aws/lambda/api-lambda",
        ] -> null
      - name                = "API lambda - 50X errors" -> null
      - query_definition_id = "2b6c079f-d355-4c8b-9a6c-28d062ebf3be" -> null
      - query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter @message like /HTTP\/\d+\.\d+\\" 50\d/
            | sort @timestamp desc
            | limit 20
        EOT -> null
    }

  # aws_cloudwatch_query_definition.api-lambda-errors will be created
  + resource "aws_cloudwatch_query_definition" "api-lambda-errors" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/lambda/api-lambda",
        ]
      + name                = "API lambda - errors"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter levelname like /ERROR/
            | sort @timestamp desc
            | limit 20
        EOT
    }

Plan: 4 to add, 0 to change, 4 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>